tutorials/cfdemSolverPiso/bubblingFluidizedBed/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.1;

deltaT          0.00025;

writeControl    adjustableRunTime;

writeInterval   0.003;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo 0.8;


functions
{
    probes
    {
        type    probes;
        functionObjectLibs ("libsampling.so");
        name    probes;
        probeLocations
        (
            (0.0018 0.005 0.022)
            (0.0054 0.005 0.022)
            (0.0090 0.005 0.022)
            (0.0126 0.005 0.022)
            (0.0162 0.005 0.022)
            (0.0198 0.005 0.022)
            (0.0234 0.005 0.022)
            (0.0270 0.005 0.022)
            (0.0306 0.005 0.022)
            (0.0342 0.005 0.022)
            (0.0378 0.005 0.022)
            (0.0414 0.005 0.022)
        );

        // fields to be probed
        fields (voidfraction);

        // write at same frequency as fields
        writeControl    timeStep;
        writeInterval   12;
    }

}
// ************************************************************************* //
